app/views/questions/show.html.erb

SELECT  1 AS one FROM "answers" WHERE "answers"."question_id" = $1 LIMIT 1  [["question_id", 1]]
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 1]]
---

<h3><%= @answers.empty? ? "No answers submitted for this question" : "Answers"%></h3>