app/controllers/answers_controller.rb

  def index
    @question = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @question = Question.find(params[:question_id])
    @answers = @question.answers
    @answer = Answer.new(answer_params)
    @answer.question = @question
    if @answer.save
      flash.notice = "Answer saved successfully!"
      redirect_to question_path(@question)
    else
      flash.notice = @answer.errors.full_messages.join(", ")
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "answers" ("question_id", "answer", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", 3]]