app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC
---
  def index
    @questions = Question.order(created_at: :desc)

INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @question = Question.new(question_params)
    require 'pry'
    binding.pry
    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "questions" SET "title" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["title", "AAVB0123456789012345678901234567890123456789"], ["updated_at", "2015-12-15 18:29:23.789193"], ["id", 3]]
---
  def update
    @question = Question.find(params[:id])
    if @question.update(question_params)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "answers" WHERE "answers"."id" = $1  [["id", 3]]
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 1]]
---
  def destroy
    @question = Question.find(params[:id])
    binding.pry
    @question.answers.destroy